In [3]:
# DataFrame
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F',
23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21],
['lisa', 'F', 20]])
df.columns = ['name', 'gender', 'age']
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [2]:
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [4]:
df.ix[1]

name      mary
gender       F
age         23
Name: 1, dtype: object

In [5]:
df.ix[1:4]

   name gender  age
1  mary      F   23
2   tom      M   35
3   ted      M   33
4  jean      F   21

In [5]:
df['name']

0    frank
1     mary
2      tom
3      ted
4     jean
5     lisa
Name: name, dtype: object

In [6]:
df[['name', 'age']]

    name  age
0  frank   29
1   mary   23
2    tom   35
3    ted   33
4   jean   21
5   lisa   20

In [7]:
df['gender'] == 'M'

0     True
1    False
2     True
3     True
4    False
5    False
Name: gender, dtype: bool

In [9]:
df[df['gender'] == 'M']

    name gender  age
0  frank      M   29
2    tom      M   35
3    ted      M   33

In [10]:
# 女性年齡平均
df[df['gender'] == 'M'].mean()

age    32.333333
dtype: float64

In [11]:
# 男性年齡平均
df[df['gender'] == 'F'].mean()

age    21.333333
dtype: float64